In [1]:
import pandas as pd
dict={
    "Tid":[1,2,3,4,5,6,7,8,9,10],
    "Refund":['yes','no','no','yes','no','no','yes','no','no','no'],
    "MaritalStatus":['single','married','single','married','divorced','married','divorced','single','married','single'],
    "TaxableIncome":['125k','100k','70k','120k','95k','60k','220k','85k','75k','90k'],
    "Cheat":['no','no','no','no','yes','no','no','yes','no','yes']
}
data=pd.DataFrame(dict)
print(data)

   Tid Refund MaritalStatus TaxableIncome Cheat
0    1    yes        single          125k    no
1    2     no       married          100k    no
2    3     no        single           70k    no
3    4    yes       married          120k    no
4    5     no      divorced           95k   yes
5    6     no       married           60k    no
6    7    yes      divorced          220k    no
7    8     no        single           85k   yes
8    9     no       married           75k    no
9   10     no        single           90k   yes

In [3]:
print(data.loc[0])

Tid                   1
Refund              yes
MaritalStatus    single
TaxableIncome      125k
Cheat                no
Name: 0, dtype: object

In [5]:
print(data.loc[4])

Tid                     5
Refund                 no
MaritalStatus    divorced
TaxableIncome         95k
Cheat                 yes
Name: 4, dtype: object

In [7]:
print(data.loc[7])

Tid                   8
Refund               no
MaritalStatus    single
TaxableIncome       85k
Cheat               yes
Name: 7, dtype: object

In [9]:
print(data.loc[8])

Tid                    9
Refund                no
MaritalStatus    married
TaxableIncome        75k
Cheat                 no
Name: 8, dtype: object

In [11]:
print(data.loc[3:7])

   Tid Refund MaritalStatus TaxableIncome Cheat
3    4    yes       married          120k    no
4    5     no      divorced           95k   yes
5    6     no       married           60k    no
6    7    yes      divorced          220k    no
7    8     no        single           85k   yes

In [15]:
print(data.iloc[4:8,2:4])

  MaritalStatus TaxableIncome
4      divorced           95k
5       married           60k
6      divorced          220k
7        single           85k

In [17]:
print(data.loc[4:8,'MaritalStatus':'Cheat'])

  MaritalStatus TaxableIncome Cheat
4      divorced           95k   yes
5       married           60k    no
6      divorced          220k    no
7        single           85k   yes
8       married           75k    no

In [19]:
print(data.loc[:,"Refund":"TaxableIncome"])

  Refund MaritalStatus TaxableIncome
0    yes        single          125k
1     no       married          100k
2     no        single           70k
3    yes       married          120k
4     no      divorced           95k
5     no       married           60k
6    yes      divorced          220k
7     no        single           85k
8     no       married           75k
9     no        single           90k

In [26]:
import pandas as pd
dataset=pd.read_csv('cognitiveData1.csv')

In [28]:
dataset.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [30]:
dataset.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [32]:
dataset.drop(4,axis=0,inplace=True)

In [34]:
dataset.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
5   6            5.4           3.9            1.7           0.4  Iris-setosa

In [36]:
dataset.drop(dataset.columns[2],axis=1,inplace=True)

In [38]:
dataset.head()

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1            1.4           0.2  Iris-setosa
1   2            4.9            1.4           0.2  Iris-setosa
2   3            4.7            1.3           0.2  Iris-setosa
3   4            4.6            1.5           0.2  Iris-setosa
5   6            5.4            1.7           0.4  Iris-setosa

In [40]:
import pandas as pd
data=pd.read_csv('data1.csv')

In [42]:
data.head()

,Employee_ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,101,Alice,HR,29,50000,4,15-03-2020,Female,5000,4.5
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8
3,104,Diana,Marketing,28,55000,3,10-02-2021,Female,4500,4.7
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5

In [44]:
df=pd.DataFrame(data)

In [48]:
print("Shape:",df.shape)

Shape: (5, 10)

In [50]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [52]:
print(df.describe())

       Employee_ID        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [54]:
print(data.head())

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   15-03-2020  Female   5000     4.5
1   19-07-2017    Male   7000     4.0
2   01-06-2013    Male   6000     3.8
3   10-02-2021  Female   4500     4.7
4   25-11-2010    Male   5000     3.5

In [56]:
print(data.tail(3))

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   01-06-2013    Male   6000     3.8
3   10-02-2021  Female   4500     4.7
4   25-11-2010    Male   5000     3.5

In [58]:
df["Salary"].mean()

60000.0

In [60]:
df["Bonus"].sum()

27500

In [62]:
df["Age"].min()

28

In [64]:
df["Rating"].max()

4.7

In [66]:
df_sorted=df.sort_values(by="Salary",ascending=False)
print(df_sorted)

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   19-07-2017    Male   7000     4.0
2   01-06-2013    Male   6000     3.8
4   25-11-2010    Male   5000     3.5
3   10-02-2021  Female   4500     4.7
0   15-03-2020  Female   5000     4.5

In [68]:
def performance(rating):
    if rating>=4.5:
        return "Excellent"
    elif rating>=4.0:
        return "Good"
    else:
        return "Average"
df["Performance_category"]=df["Rating"].apply(performance)
print(df)

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating Performance_category
0   15-03-2020  Female   5000     4.5            Excellent
1   19-07-2017    Male   7000     4.0                 Good
2   01-06-2013    Male   6000     3.8              Average
3   10-02-2021  Female   4500     4.7            Excellent
4   25-11-2010    Male   5000     3.5              Average

In [70]:
print(df.isnull().sum())

Employee_ID             0
Name                    0
Department              0
Age                     0
Salary                  0
Years_of_Experience     0
Joining_Date            0
Gender                  0
Bonus                   0
Rating                  0
Performance_category    0
dtype: int64

In [72]:
df.rename(columns={"Employee_ID":"ID"},inplace=True)
print(df.head())

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   15-03-2020
1  102      Bob         IT   34   70000                    8   19-07-2017
2  103  Charlie         IT   41   65000                   10   01-06-2013
3  104    Diana  Marketing   28   55000                    3   10-02-2021
4  105   Edward      Sales   38   60000                   12   25-11-2010

   Gender  Bonus  Rating Performance_category
0  Female   5000     4.5            Excellent
1    Male   7000     4.0                 Good
2    Male   6000     3.8              Average
3  Female   4500     4.7            Excellent
4    Male   5000     3.5              Average

In [74]:
df[df["Years_of_Experience"]>5]

,ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance_category
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0,Good
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8,Average
4,105,Edward,Sales,38,60000,12,25-11-2010,Male,5000,3.5,Average

In [78]:
df[df["Department"]=="IT"]

,ID,Name,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating,Performance_category
1,102,Bob,IT,34,70000,8,19-07-2017,Male,7000,4.0,Good
2,103,Charlie,IT,41,65000,10,01-06-2013,Male,6000,3.8,Average

In [80]:
df["Tax"]=df["Salary"]*0.10
print(df)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   15-03-2020
1  102      Bob         IT   34   70000                    8   19-07-2017
2  103  Charlie         IT   41   65000                   10   01-06-2013
3  104    Diana  Marketing   28   55000                    3   10-02-2021
4  105   Edward      Sales   38   60000                   12   25-11-2010

   Gender  Bonus  Rating Performance_category     Tax
0  Female   5000     4.5            Excellent  5000.0
1    Male   7000     4.0                 Good  7000.0
2    Male   6000     3.8              Average  6500.0
3  Female   4500     4.7            Excellent  5500.0
4    Male   5000     3.5              Average  6000.0

In [84]:
df.to_csv("data1.csv",index=False)